In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('sales.csv')
df.head()

         Date   Sales      GDP Unemployment      Population  Popularity
0  13-06-2010  5422.0  1675.62        5.55%  1,24,06,13,620       21.25
1  14-06-2010  7047.0  1675.62        5.55%  1,24,06,13,620       21.25
2  15-06-2010  1572.0  1675.62        5.55%  1,24,06,13,620       21.25
3  16-06-2010  5657.0  1675.62        5.55%  1,24,06,13,620       21.25
4  17-06-2010  3668.0  1675.62        5.55%  1,24,06,13,620       21.25

In [3]:
df['Date'].value_counts()

13-06-2010    1
13-02-2018    1
15-02-2018    1
16-02-2018    1
17-02-2018    1
             ..
25-04-2014    1
26-04-2014    1
27-04-2014    1
28-04-2014    1
30-12-2021    1
Name: Date, Length: 4202, dtype: int64

In [4]:
df['GDP'].value_counts()

1823.05    364
1856.72    364
2039.13    364
2103.59    364
2651.47    364
2702.93    364
2831.55    364
3173.40    364
1827.64    363
2294.80    363
2667.69    363
1675.62    201
Name: GDP, dtype: int64

In [5]:
df.shape

(4600, 6)

In [6]:
df.tail()

     Date  Sales  GDP Unemployment Population  Popularity
4595  NaN    NaN  NaN          NaN        NaN         NaN
4596  NaN    NaN  NaN          NaN        NaN         NaN
4597  NaN    NaN  NaN          NaN        NaN         NaN
4598  NaN    NaN  NaN          NaN        NaN         NaN
4599  NaN    NaN  NaN          NaN        NaN         NaN

In [7]:
df.isnull().sum()

Date            398
Sales           398
GDP             398
Unemployment    398
Population      398
Popularity      398
dtype: int64

In [8]:
df = df.dropna()
df.isnull().sum()

Date            0
Sales           0
GDP             0
Unemployment    0
Population      0
Popularity      0
dtype: int64

In [9]:
X=df.drop('Sales',axis='columns')
X.head()

         Date      GDP Unemployment      Population  Popularity
0  13-06-2010  1675.62        5.55%  1,24,06,13,620       21.25
1  14-06-2010  1675.62        5.55%  1,24,06,13,620       21.25
2  15-06-2010  1675.62        5.55%  1,24,06,13,620       21.25
3  16-06-2010  1675.62        5.55%  1,24,06,13,620       21.25
4  17-06-2010  1675.62        5.55%  1,24,06,13,620       21.25

In [10]:
y=df['Sales']
y.head()

0    5422.0
1    7047.0
2    1572.0
3    5657.0
4    3668.0
Name: Sales, dtype: float64

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4202 entries, 0 to 4201
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          4202 non-null   object
 1   Sales         4202 non-null   float64
 2   GDP           4202 non-null   float64
 3   Unemployment  4202 non-null   object
 4   Population    4202 non-null   object
 5   Popularity    4202 non-null   float64
dtypes: float64(3), object(3)
memory usage: 229.8+ KB

In [12]:
X.head()

         Date      GDP Unemployment      Population  Popularity
0  13-06-2010  1675.62        5.55%  1,24,06,13,620       21.25
1  14-06-2010  1675.62        5.55%  1,24,06,13,620       21.25
2  15-06-2010  1675.62        5.55%  1,24,06,13,620       21.25
3  16-06-2010  1675.62        5.55%  1,24,06,13,620       21.25
4  17-06-2010  1675.62        5.55%  1,24,06,13,620       21.25

In [13]:

X[['Date', 'Month', 'Year']] = X["Date"].apply(lambda x: pd.Series(str(x).split("-")))
X.head()

  Date      GDP Unemployment      Population  Popularity Month  Year
0   13  1675.62        5.55%  1,24,06,13,620       21.25    06  2010
1   14  1675.62        5.55%  1,24,06,13,620       21.25    06  2010
2   15  1675.62        5.55%  1,24,06,13,620       21.25    06  2010
3   16  1675.62        5.55%  1,24,06,13,620       21.25    06  2010
4   17  1675.62        5.55%  1,24,06,13,620       21.25    06  2010

In [14]:
X['Date'] = X['Date'].astype(int)
X['Month'] = X['Month'].astype(int)
X['Year'] = X['Year'].astype(int)
X.head()

   Date      GDP Unemployment      Population  Popularity  Month  Year
0    13  1675.62        5.55%  1,24,06,13,620       21.25      6  2010
1    14  1675.62        5.55%  1,24,06,13,620       21.25      6  2010
2    15  1675.62        5.55%  1,24,06,13,620       21.25      6  2010
3    16  1675.62        5.55%  1,24,06,13,620       21.25      6  2010
4    17  1675.62        5.55%  1,24,06,13,620       21.25      6  2010

In [15]:
X['Unemployment'] = X['Unemployment'].str.replace('%', '')
X['Unemployment'] = X['Unemployment'].astype(float)
X.head()

   Date      GDP  Unemployment      Population  Popularity  Month  Year
0    13  1675.62          5.55  1,24,06,13,620       21.25      6  2010
1    14  1675.62          5.55  1,24,06,13,620       21.25      6  2010
2    15  1675.62          5.55  1,24,06,13,620       21.25      6  2010
3    16  1675.62          5.55  1,24,06,13,620       21.25      6  2010
4    17  1675.62          5.55  1,24,06,13,620       21.25      6  2010

In [16]:
X['Population'] = X['Population'].str.replace(',', '')
X['Population'] = X['Population'].astype(int)
X.head()

   Date      GDP  Unemployment  Population  Popularity  Month  Year
0    13  1675.62          5.55  1240613620       21.25      6  2010
1    14  1675.62          5.55  1240613620       21.25      6  2010
2    15  1675.62          5.55  1240613620       21.25      6  2010
3    16  1675.62          5.55  1240613620       21.25      6  2010
4    17  1675.62          5.55  1240613620       21.25      6  2010

In [17]:
X = X[['Date', 'Month', 'Year', 'GDP', 'Unemployment', 'Population']]

In [18]:
X.head()

   Date  Month  Year      GDP  Unemployment  Population
0    13      6  2010  1675.62          5.55  1240613620
1    14      6  2010  1675.62          5.55  1240613620
2    15      6  2010  1675.62          5.55  1240613620
3    16      6  2010  1675.62          5.55  1240613620
4    17      6  2010  1675.62          5.55  1240613620

In [19]:
X.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4202 entries, 0 to 4201
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          4202 non-null   int32
 1   Month         4202 non-null   int32
 2   Year          4202 non-null   int32
 3   GDP           4202 non-null   float64
 4   Unemployment  4202 non-null   float64
 5   Population    4202 non-null   int32
dtypes: float64(2), int32(4)
memory usage: 164.1 KB

In [20]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size = 0.2, random_state = 2)

In [21]:
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import OneHotEncoder
from sklearn.metrics import r2_score

In [22]:
from sklearn.ensemble import RandomForestRegressor
import numpy as np

In [23]:



step1 =  RandomForestRegressor(n_estimators=100,
                               random_state=3,
                               max_samples=0.5,
                               max_features=0.75,
                               max_depth=15)


pipe = Pipeline([
    ('step1',step1)
])

pipe.fit(X_train,y_train)
y_pred = pipe.predict(X_test)
print('R2_score',r2_score(y_test,y_pred))

R2_score -0.13322985132301524